Autodesk.Revit.DB.BoundingBoxIsInsideFilter.#ctor(Autodesk.Revit.DB.Outline,System.Double,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline,
with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline.
outline:
The Outline used to find elements with a bounding box that are contained by it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
inverted:
True if the filter should be inverted and match all elements with a bounding box that are not contained by the given Outline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
-or-
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.BoundingBoxIsInsideFilter.#ctor(Autodesk.Revit.DB.Outline,System.Double)
Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline.
outline:
The Outline used to find elements with a bounding box that are contained by it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
-or-
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.BoundingBoxIsInsideFilter.#ctor(Autodesk.Revit.DB.Outline,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline,
with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline.
outline:
The Outline used to find elements with a bounding box that are contained by it.
inverted:
True if the filter should be inverted and match all elements with a bounding box that are not contained by the given Outline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.BoundingBoxIsInsideFilter.#ctor(Autodesk.Revit.DB.Outline)
Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline.
outline:
The Outline used to find elements with a bounding box that are contained by it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
outline is an empty Outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011